stevenj/avr-libc3/include/avr/io/atmega649a.h
/*
--------------------------------------------------------------------------------
JTAG - JTAG Interface
--------------------------------------------------------------------------------
*/

typedef struct JTAG_struct
{
    register8_t rsv_0x00[81]; /* RESERVED REGISTER BLOCK */
    register8_t OCDR;         /* On-Chip Debug Related Register in I/O Memory */
    register8_t rsv_0x52[2];  /* RESERVED REGISTER BLOCK */
    register8_t MCUSR;        /* MCU Status Register */
    register8_t MCUCR;        /* MCU Control Register */
} JTAG_t;


/* JTAG Interface Disable */
typedef enum JTAG_JTD_enum
{
    JTAG_JTD_CLEAR_gc = (0x00), /* JTAG Interface Disable - CLEAR */
    JTAG_JTD_SET_gc   = (0x80), /* JTAG Interface Disable - SET */
} JTAG_JTD_t;

/* JTAG Reset Flag */
typedef enum JTAG_JTRF_enum
{
    JTAG_JTRF_CLEAR_gc = (0x00), /* JTAG Reset Flag - CLEAR */
    JTAG_JTRF_SET_gc   = (0x10), /* JTAG Reset Flag - SET */
} JTAG_JTRF_t;

/*
--------------------------------------------------------------------------------
LCD - Liquid Crystal Display
--------------------------------------------------------------------------------
*/

typedef struct LCD_struct
{
    register8_t rsv_0x00[228]; /* RESERVED REGISTER BLOCK */
    register8_t LCDCRA;        /* LCD Control Register A */
    register8_t LCDCRB;        /* LCD Control and Status Register B */
    register8_t LCDFRR;        /* LCD Frame Rate Register */
    register8_t LCDCCR;        /* LCD Contrast Control Register */
    register8_t rsv_0xE8[4];   /* RESERVED REGISTER BLOCK */
    register8_t LCDDR0;        /* LCD Data Register 0 */
    register8_t LCDDR1;        /* LCD Data Register 1 */
    register8_t LCDDR2;        /* LCD Data Register 2 */
    register8_t LCDDR3;        /* LCD Data Register 3 */
    register8_t rsv_0xF0;      /* RESERVED REGISTER */
    register8_t LCDDR5;        /* LCD Data Register 5 */
    register8_t LCDDR6;        /* LCD Data Register 6 */
    register8_t LCDDR7;        /* LCD Data Register 7 */
    register8_t LCDDR8;        /* LCD Data Register 8 */
    register8_t rsv_0xF5;      /* RESERVED REGISTER */
    register8_t LCDDR10;       /* LCD Data Register 10 */
    register8_t LCDDR11;       /* LCD Data Register 11 */
    register8_t LCDDR12;       /* LCD Data Register 12 */
    register8_t LCDDR13;       /* LCD Data Register 13 */
    register8_t rsv_0xFA;      /* RESERVED REGISTER */
    register8_t LCDDR15;       /* LCD Data Register 15 */
    register8_t LCDDR16;       /* LCD Data Register 16 */
    register8_t LCDDR17;       /* LCD Data Register 17 */
    register8_t LCDDR18;       /* LCD Data Register 18 */
} LCD_t;


/* LCD Prescaler Selects */
typedef enum LCD_LCDPS_enum
{
    LCD_LCDPS_VAL_0x00_gc = (0x00<<4), /* ClkLCD/16 */
    LCD_LCDPS_VAL_0x01_gc = (0x01<<4), /* ClkLCD/64 */
    LCD_LCDPS_VAL_0x02_gc = (0x02<<4), /* ClkLCD/128 */
    LCD_LCDPS_VAL_0x03_gc = (0x03<<4), /* ClkLCD/256 */
    LCD_LCDPS_VAL_0x04_gc = (0x04<<4), /* ClkLCD/512 */
    LCD_LCDPS_VAL_0x05_gc = (0x05<<4), /* ClkLCD/1024 */
    LCD_LCDPS_VAL_0x06_gc = (0x06<<4), /* ClkLCD/2048 */
    LCD_LCDPS_VAL_0x07_gc = (0x07<<4), /* ClkLCD/4096 */
} LCD_LCDPS_t;

/* LCD Clock Dividers */
typedef enum LCD_LCDCD_enum
{
    LCD_LCDCD_VAL_0x00_gc = (0x00), /* 1 */
    LCD_LCDCD_VAL_0x01_gc = (0x01), /* 2 */
    LCD_LCDCD_VAL_0x02_gc = (0x02), /* 3 */
    LCD_LCDCD_VAL_0x03_gc = (0x03), /* 4 */
    LCD_LCDCD_VAL_0x04_gc = (0x04), /* 5 */
    LCD_LCDCD_VAL_0x05_gc = (0x05), /* 6 */
    LCD_LCDCD_VAL_0x06_gc = (0x06), /* 7 */
    LCD_LCDCD_VAL_0x07_gc = (0x07), /* 8 */
} LCD_LCDCD_t;

/* LCD CLock Select */
typedef enum LCD_LCDCS_enum
{
    LCD_LCDCS_CLEAR_gc = (0x00), /* LCD CLock Select - CLEAR */
    LCD_LCDCS_SET_gc   = (0x80), /* LCD CLock Select - SET */
} LCD_LCDCS_t;

/* LCD 1/2 Bias Select */
typedef enum LCD_LCD2B_enum
{
    LCD_LCD2B_CLEAR_gc = (0x00), /* LCD 1/2 Bias Select - CLEAR */
    LCD_LCD2B_SET_gc   = (0x40), /* LCD 1/2 Bias Select - SET */
} LCD_LCD2B_t;

/* LCD Mux Selects */
#define LCD_LCDCRB_LCDMUX_gc(x) ((x<<4) & 0x30)

/* LCD Port Masks */
typedef enum LCD_LCDPM_enum
{
    LCD_LCDPM_VAL_0x00_gc = (0x00), /* SEG0:12 */
    LCD_LCDPM_VAL_0x01_gc = (0x01), /* SEG0:14 */
    LCD_LCDPM_VAL_0x02_gc = (0x02), /* SEG0:15 */
    LCD_LCDPM_VAL_0x03_gc = (0x03), /* SEG0:18 */
    LCD_LCDPM_VAL_0x04_gc = (0x04), /* SEG0:20 */
    LCD_LCDPM_VAL_0x05_gc = (0x05), /* SEG0:22 */
    LCD_LCDPM_VAL_0x06_gc = (0x06), /* SEG0:23 */
    LCD_LCDPM_VAL_0x07_gc = (0x07), /* SEG0:24 */
    LCD_LCDPM_VAL_0x08_gc = (0x08), /* SEG0:26 */
    LCD_LCDPM_VAL_0x09_gc = (0x09), /* SEG0:28 */
    LCD_LCDPM_VAL_0x0A_gc = (0x0A), /* SEG0:30 */
    LCD_LCDPM_VAL_0x0B_gc = (0x0B), /* SEG0:32 */
    LCD_LCDPM_VAL_0x0C_gc = (0x0C), /* SEG0:34 */
    LCD_LCDPM_VAL_0x0D_gc = (0x0D), /* SEG0:36 */
    LCD_LCDPM_VAL_0x0E_gc = (0x0E), /* SEG0:38 */
    LCD_LCDPM_VAL_0x0F_gc = (0x0F), /* SEG0:39 */
} LCD_LCDPM_t;

/* LCD Enable */
typedef enum LCD_LCDEN_enum
{
    LCD_LCDEN_CLEAR_gc = (0x00), /* LCD Enable - CLEAR */
    LCD_LCDEN_SET_gc   = (0x80), /* LCD Enable - SET */
} LCD_LCDEN_t;

/* LCD A or B waveform */
typedef enum LCD_LCDAB_enum
{
    LCD_LCDAB_CLEAR_gc = (0x00), /* LCD A or B waveform - CLEAR */
    LCD_LCDAB_SET_gc   = (0x40), /* LCD A or B waveform - SET */
} LCD_LCDAB_t;

/* LCD Interrupt Flag */
typedef enum LCD_LCDIF_enum
{
    LCD_LCDIF_CLEAR_gc = (0x00), /* LCD Interrupt Flag - CLEAR */
    LCD_LCDIF_SET_gc   = (0x10), /* LCD Interrupt Flag - SET */
} LCD_LCDIF_t;

/* LCD Interrupt Enable */
typedef enum LCD_LCDIE_enum
{
    LCD_LCDIE_CLEAR_gc = (0x00), /* LCD Interrupt Enable - CLEAR */
    LCD_LCDIE_SET_gc   = (0x08), /* LCD Interrupt Enable - SET */
} LCD_LCDIE_t;

/* LCD Blanking */
typedef enum LCD_LCDBL_enum
{
    LCD_LCDBL_CLEAR_gc = (0x00), /* LCD Blanking - CLEAR */
    LCD_LCDBL_SET_gc   = (0x01), /* LCD Blanking - SET */
} LCD_LCDBL_t;

/*
--------------------------------------------------------------------------------
EXINT - External Interrupts
--------------------------------------------------------------------------------
*/

