stevenj/avr-libc3/include/avr/io/atmega649a.h
/*
--------------------------------------------------------------------------------
JTAG - JTAG Interface
--------------------------------------------------------------------------------
*/


/* JTAG Interface Disable */
#define JTAG_JTD_CLEAR_gc (0x00) /* JTAG Interface Disable - CLEAR */
#define JTAG_JTD_SET_gc   (0x80) /* JTAG Interface Disable - SET */


/* JTAG Reset Flag */
#define JTAG_JTRF_CLEAR_gc (0x00) /* JTAG Reset Flag - CLEAR */
#define JTAG_JTRF_SET_gc   (0x10) /* JTAG Reset Flag - SET */


/*
--------------------------------------------------------------------------------
LCD - Liquid Crystal Display
--------------------------------------------------------------------------------
*/


/* LCD Prescaler Selects */
#define LCD_LCDPS_VAL_0x00_gc (0x00<<4) /* ClkLCD/16 */
#define LCD_LCDPS_VAL_0x01_gc (0x01<<4) /* ClkLCD/64 */
#define LCD_LCDPS_VAL_0x02_gc (0x02<<4) /* ClkLCD/128 */
#define LCD_LCDPS_VAL_0x03_gc (0x03<<4) /* ClkLCD/256 */
#define LCD_LCDPS_VAL_0x04_gc (0x04<<4) /* ClkLCD/512 */
#define LCD_LCDPS_VAL_0x05_gc (0x05<<4) /* ClkLCD/1024 */
#define LCD_LCDPS_VAL_0x06_gc (0x06<<4) /* ClkLCD/2048 */
#define LCD_LCDPS_VAL_0x07_gc (0x07<<4) /* ClkLCD/4096 */


/* LCD Clock Dividers */
#define LCD_LCDCD_VAL_0x00_gc (0x00) /* 1 */
#define LCD_LCDCD_VAL_0x01_gc (0x01) /* 2 */
#define LCD_LCDCD_VAL_0x02_gc (0x02) /* 3 */
#define LCD_LCDCD_VAL_0x03_gc (0x03) /* 4 */
#define LCD_LCDCD_VAL_0x04_gc (0x04) /* 5 */
#define LCD_LCDCD_VAL_0x05_gc (0x05) /* 6 */
#define LCD_LCDCD_VAL_0x06_gc (0x06) /* 7 */
#define LCD_LCDCD_VAL_0x07_gc (0x07) /* 8 */


/* LCD CLock Select */
#define LCD_LCDCS_CLEAR_gc (0x00) /* LCD CLock Select - CLEAR */
#define LCD_LCDCS_SET_gc   (0x80) /* LCD CLock Select - SET */


/* LCD 1/2 Bias Select */
#define LCD_LCD2B_CLEAR_gc (0x00) /* LCD 1/2 Bias Select - CLEAR */
#define LCD_LCD2B_SET_gc   (0x40) /* LCD 1/2 Bias Select - SET */


/* LCD Mux Selects */
#define LCD_LCDCRB_LCDMUX_gc(x) ((x<<4) & 0x30)

/* LCD Port Masks */
#define LCD_LCDPM_VAL_0x00_gc (0x00) /* SEG0:12 */
#define LCD_LCDPM_VAL_0x01_gc (0x01) /* SEG0:14 */
#define LCD_LCDPM_VAL_0x02_gc (0x02) /* SEG0:15 */
#define LCD_LCDPM_VAL_0x03_gc (0x03) /* SEG0:18 */
#define LCD_LCDPM_VAL_0x04_gc (0x04) /* SEG0:20 */
#define LCD_LCDPM_VAL_0x05_gc (0x05) /* SEG0:22 */
#define LCD_LCDPM_VAL_0x06_gc (0x06) /* SEG0:23 */
#define LCD_LCDPM_VAL_0x07_gc (0x07) /* SEG0:24 */
#define LCD_LCDPM_VAL_0x08_gc (0x08) /* SEG0:26 */
#define LCD_LCDPM_VAL_0x09_gc (0x09) /* SEG0:28 */
#define LCD_LCDPM_VAL_0x0A_gc (0x0A) /* SEG0:30 */
#define LCD_LCDPM_VAL_0x0B_gc (0x0B) /* SEG0:32 */
#define LCD_LCDPM_VAL_0x0C_gc (0x0C) /* SEG0:34 */
#define LCD_LCDPM_VAL_0x0D_gc (0x0D) /* SEG0:36 */
#define LCD_LCDPM_VAL_0x0E_gc (0x0E) /* SEG0:38 */
#define LCD_LCDPM_VAL_0x0F_gc (0x0F) /* SEG0:39 */


/* LCD Enable */
#define LCD_LCDEN_CLEAR_gc (0x00) /* LCD Enable - CLEAR */
#define LCD_LCDEN_SET_gc   (0x80) /* LCD Enable - SET */


/* LCD A or B waveform */
#define LCD_LCDAB_CLEAR_gc (0x00) /* LCD A or B waveform - CLEAR */
#define LCD_LCDAB_SET_gc   (0x40) /* LCD A or B waveform - SET */


/* LCD Interrupt Flag */
#define LCD_LCDIF_CLEAR_gc (0x00) /* LCD Interrupt Flag - CLEAR */
#define LCD_LCDIF_SET_gc   (0x10) /* LCD Interrupt Flag - SET */


/* LCD Interrupt Enable */
#define LCD_LCDIE_CLEAR_gc (0x00) /* LCD Interrupt Enable - CLEAR */
#define LCD_LCDIE_SET_gc   (0x08) /* LCD Interrupt Enable - SET */


/* LCD Blanking */
#define LCD_LCDBL_CLEAR_gc (0x00) /* LCD Blanking - CLEAR */
#define LCD_LCDBL_SET_gc   (0x01) /* LCD Blanking - SET */


/*
--------------------------------------------------------------------------------
EXINT - External Interrupts
--------------------------------------------------------------------------------
*/


/* External Interrupt Sense Control 0 Bit 1 */
#define EXINT_ISC01_CLEAR_gc (0x00) /* External Interrupt Sense Control 0 Bit 1 - CLEAR */
#define EXINT_ISC01_SET_gc   (0x02) /* External Interrupt Sense Control 0 Bit 1 - SET */


/* External Interrupt Sense Control 0 Bit 0 */
#define EXINT_ISC00_VAL_0x00_gc (0x00) /* Low Level of INTX */
#define EXINT_ISC00_VAL_0x01_gc (0x01) /* Any Logical Change of INTX */
#define EXINT_ISC00_VAL_0x02_gc (0x02) /* Falling Edge of INTX */
#define EXINT_ISC00_VAL_0x03_gc (0x03) /* Rising Edge of INTX */


/* Pin Change Interrupt Enables */
#define EXINT_EIMSK_PCIE_gc(x) ((x<<4) & 0xF0)

/* External Interrupt Request 0 Enable */
#define EXINT_INT0_CLEAR_gc (0x00) /* External Interrupt Request 0 Enable - CLEAR */
#define EXINT_INT0_SET_gc   (0x01) /* External Interrupt Request 0 Enable - SET */


/* Pin Change Interrupt Flags */
#define EXINT_EIFR_PCIF_gc(x) ((x<<4) & 0xF0)

/* External Interrupt Flag 0 */
#define EXINT_INTF0_CLEAR_gc (0x00) /* External Interrupt Flag 0 - CLEAR */
#define EXINT_INTF0_SET_gc   (0x01) /* External Interrupt Flag 0 - SET */


/*
--------------------------------------------------------------------------------
EEPROM - EEPROM
--------------------------------------------------------------------------------
*/


/* EEPROM Ready Interrupt Enable */
#define EEPROM_EERIE_CLEAR_gc (0x00) /* EEPROM Ready Interrupt Enable - CLEAR */
#define EEPROM_EERIE_SET_gc   (0x08) /* EEPROM Ready Interrupt Enable - SET */


/* EEPROM Master Write Enable */
#define EEPROM_EEMWE_CLEAR_gc (0x00) /* EEPROM Master Write Enable - CLEAR */
#define EEPROM_EEMWE_SET_gc   (0x04) /* EEPROM Master Write Enable - SET */


/* EEPROM Write Enable */
#define EEPROM_EEWE_CLEAR_gc (0x00) /* EEPROM Write Enable - CLEAR */
#define EEPROM_EEWE_SET_gc   (0x02) /* EEPROM Write Enable - SET */


/* EEPROM Read Enable */
#define EEPROM_EERE_CLEAR_gc (0x00) /* EEPROM Read Enable - CLEAR */
#define EEPROM_EERE_SET_gc   (0x01) /* EEPROM Read Enable - SET */


/*
--------------------------------------------------------------------------------
PORT - I/O Port
--------------------------------------------------------------------------------
*/


/*
--------------------------------------------------------------------------------
PORT - I/O Port
--------------------------------------------------------------------------------
*/


